#+TITLE: List Processing
#+AUTHOR: vinci_g
#+DESCRIPTION: Intro to Elisp - Ch1. List Processing
#+OPTIONS: toc:nil

** Evaluating Inner Lists

When the interpreter evaluates a list with an inner list, as mentioned before, it evaluates the innermost first and uses the return value to be used for the outer list.

#+begin_src emacs-lisp
  (+ 2 (+ 3 3))
#+end_src

#+RESULTS:
: 8

The interpreter evaluates ~(+ 3 3)~ first then proceeds to do ~(+ 2 6)~.

Placing the cursor right after a parenthesis evaluates that expression using that parenthesis. Placing it right after a number prints the number itself.

** Example Variable

Take for example ~fill-column~ which is a symbol with a value attached to it.

#+begin_src emacs-lisp
  fill-column
#+end_src

#+RESULTS:
: 70

We can also /bind/ the variable to a value such as number, string, or list. We can also bind a variable to a function definition.

** An Argument as the Value of a Variable or List

An argument can be a symbol that returns a value when it is evaluated. An example is ~fill-column~ which returns a number.

#+begin_src emacs-lisp
  (+ 2 fill-column)
#+end_src

#+RESULTS:
: 72

Any number value assigned to fill column will be added to ~2~ in this example.

An argument can also be a list that returns a value when evaluated.

#+begin_src emacs-lisp
  (concat "The " (number-to-string (+ 2 fill-column)) " red foxes")
#+end_src

#+RESULTS:
: The 72 red foxes

** Variable Number of Arguments

Functions such as ~concat~, ~+~, or ~*~, can take any number of arguments.

#+begin_src emacs-lisp
  (+ 3 4 5)
#+end_src

#+RESULTS:
: 12

#+begin_src emacs-lisp
  (* 3 4 5)
#+end_src

#+RESULTS:
: 60

** The 'message' Function

The ~message~ function takes a variable number of arguments and is used to send messages to the user.

#+begin_src emacs-lisp
  (message "This message appears in the echo area")
#+end_src

#+RESULTS:
: This message appears in the echo area

The whole string is a single argument. If there is a ~%s~ in the quoted string of characters, the ~message~ function does not print ~%s~ but looks to the argument that follows the string (much like ~printf~ in C).

#+begin_src emacs-lisp
  (message "The name of the buffer is: %s." (buffer-name))
#+end_src

#+RESULTS:
: The name of the buffer is: List Processing.org.

The function ~buffer-name~ returns the name of the buffer as a string which the ~message~ function inserts in place of ~%s~.

~%d~ prints a value as an integer.

If there is more than one ~%s~ in the quoted string, it is replaced by the arguments in that order.

#+begin_src emacs-lisp
  (message "There are %d %s in the office!"
           (- fill-column 14) "pink elephants")
#+end_src

#+RESULTS:
: There are 56 pink elephants in the office!

The interpreter evaluates the inner function first then replaces ~%d~ and ~%s~ in the order of the arguments.

#+begin_src emacs-lisp
  (message "He saw %d %s"
           (- fill-column 32)
           (concat "red "
                   (substring
                    "The quick brown foxes jumped." 16 21)
                   " leaping."))
#+end_src

#+RESULTS:
: He saw 38 red foxes leaping.

** Using 'setq'

#+begin_src emacs-lisp
  (setq flowers '(rose violet daisy buttercup))
#+end_src

#+RESULTS:
| rose | violet | daisy | buttercup |

#+begin_src emacs-lisp
  flowers
#+end_src

#+RESULTS:
| rose | violet | daisy | buttercup |

We bound the symbol ~flowers~ to the list ~'(rose violet daisy buttercup)~ using setq and evaluating ~flowers~ returns us the list.

Evaluating the variable with a quote will return the variable itself.

#+begin_src emacs-lisp
  'flowers
#+end_src

#+RESULTS:
: flowers

~setq~ also permits setting up several variables to different values all in one expression.

#+begin_src emacs-lisp
  (setq carnivores '(lion tiger jaguar)
        trees '(pine fir oak maple)
        herbivores '(gazelle antelope zebra))
#+end_src

#+begin_src emacs-lisp
  carnivores
#+end_src

#+RESULTS:
| lion | tiger | jaguar |

#+begin_src emacs-lisp
  trees
#+end_src

#+RESULTS:
| pine | fir | oak | maple |

#+begin_src emacs-lisp
  herbivores
#+end_src

#+RESULTS:
| gazelle | antelope | zebra |

We can also say that ~setq~ makes the symbol *point* to the list.

** Counting

#+begin_src emacs-lisp
  (setq counter 0)
#+end_src

#+RESULTS:
: 0

#+begin_src emacs-lisp
  (setq counter (+ counter 1))
#+end_src

#+RESULTS:
: 1

#+begin_src emacs-lisp
  counter
#+end_src

#+RESULTS:
: 1

* Exercises

1. Generate an error message by evaluating an appropriate symbol that is not within parentheses

   #+begin_src emacs-lisp
     +
   #+end_src

~+~ is not a variable so evaluating it as one would return an error ~void-variable +~

2. Generate an error message by evaluating an appropriate symbol that is between parentheses.

   #+begin_src emacs-lisp
     (fill-column)
   #+end_src

   ~fill-column~ is a variable and not a function. When evaluating a list without a preceding quote, the interpreter takes the first symbol on the list and evaluates it as a function, therefore in this case, it returns an error ~void-function fill-column~.

3. Create a counter that increments by two rather than one.

   #+begin_src emacs-lisp
     (setq counter 0)
   #+end_src

   #+RESULTS:
   : 0

   #+begin_src emacs-lisp
     (setq counter (+ counter 2))
   #+end_src

   #+RESULTS:
   : 2

   #+begin_src emacs-lisp
     counter
   #+end_src

   #+RESULTS:
   : 2

4. Write an expression that prints a message in the echo area when evaluated.

   #+begin_src emacs-lisp
     (message "hello world!")
   #+end_src

   #+RESULTS:
   : hello world!
